// See https://aka.ms/new-console-template for more information

//Напишите программу, которая принимает на вход трехзначное целое число
// и на выходе показывает сумму первой и последней цифры этого числа


int a = int.Parse(Console.ReadLine()!);
Console.WriteLine(a / 100  + a % 10);
    

